---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheet.GetSheetLocation
source: html/71a5aa6f-f57d-001d-bb8a-a5f8e7c27bfe.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.GetSheetLocation Method

Gets the position and the orientation of the Fabric Sheet instance.

## Syntax (C#)
```csharp
public Transform GetSheetLocation()
```

## Returns
The location of the Fabric Sheet instance.